; domain
(define (domain hospital-domain)
  (:requirements :strips :typing)

  (:types
    ambulance
    patient
    location
    hospital - location   ;; ✅ hospitals are locations
  )

  (:predicates
    (at ?a - ambulance ?l - location)
    (patient-at ?p - patient ?l - location)
    (in-ambulance ?p - patient ?a - ambulance)
    (connected ?l1 - location ?l2 - location)
    (blocked ?l1 - location ?l2 - location)
    (empty ?a - ambulance)
  )

  (:action Move
    :parameters (?a - ambulance ?from - location ?to - location)
    :precondition (and
      (at ?a ?from)
      (connected ?from ?to)
      (not (blocked ?from ?to))
    )
    :effect (and
      (not (at ?a ?from))
      (at ?a ?to)
    )
  )

  (:action Pickup-Patient
    :parameters (?p - patient ?a - ambulance ?l - location)
    :precondition (and
      (at ?a ?l)
      (patient-at ?p ?l)
      (empty ?a)
    )
    :effect (and
      (in-ambulance ?p ?a)
      (not (patient-at ?p ?l))
      (not (empty ?a))
    )
  )

  (:action Dropoff-Patient
    :parameters (?p - patient ?a - ambulance ?h - hospital)
    :precondition (and
      (at ?a ?h)
      (in-ambulance ?p ?a)
    )
    :effect (and
      (patient-at ?p ?h)
      (empty ?a)
      (not (in-ambulance ?p ?a))
    )
  )
)

; problem
(define (problem hospital-problem)
  (:domain hospital-domain)

  (:objects
    a1 a2 - ambulance
    p1 p2 p3 - patient
    loc1 loc2 loc3 - location
    h1 h2 - hospital
  )

  (:init
    ;; Ambulances initial positions
    (at a1 h1)
    (at a2 h2)

    ;; Patients initial positions
    (patient-at p1 loc1)
    (patient-at p2 loc2)
    (patient-at p3 loc3)

    ;; Bidirectional connectivity between all required routes
    (connected h1 loc1)
    (connected loc1 h1)
    (connected h1 loc3)
    (connected loc3 h1)
    (connected h2 loc2)
    (connected loc2 h2)

    ;; All routes are unblocked
    (not (blocked h1 loc1))
    (not (blocked loc1 h1))
    (not (blocked h1 loc3))
    (not (blocked loc3 h1))
    (not (blocked h2 loc2))
    (not (blocked loc2 h2))

    ;; Both ambulances are empty
    (empty a1)
    (empty a2)
  )

  (:goal (and
    (patient-at p1 h1)
    (patient-at p2 h2)
    (patient-at p3 h1)
  ))
)

; plan
1. (move a1 h1 loc1)
   deleted: (at a1 h1)
   added: (at a1 loc1)
   goals met: 0 of 3
2. (move a2 h2 loc2)
   deleted: (at a2 h2)
   added: (at a2 loc2)
   goals met: 0 of 3
3. (pickup-patient p1 a1 loc1)
   deleted: (patient-at p1 loc1) (empty a1)
   added: (in-ambulance p1 a1)
   goals met: 0 of 3
4. (move a1 loc1 h1)
   deleted: (at a1 loc1)
   added: (at a1 h1)
   goals met: 0 of 3
5. (dropoff-patient p1 a1 h1)
   deleted: (in-ambulance p1 a1)
   added: (patient-at p1 h1) (empty a1)
   goals met: 1 of 3
6. (pickup-patient p2 a2 loc2)
   deleted: (patient-at p2 loc2) (empty a2)
   added: (in-ambulance p2 a2)
   goals met: 1 of 3
7. (move a2 loc2 h2)
   deleted: (at a2 loc2)
   added: (at a2 h2)
   goals met: 1 of 3
8. (dropoff-patient p2 a2 h2)
   deleted: (in-ambulance p2 a2)
   added: (patient-at p2 h2) (empty a2)
   goals met: 2 of 3
9. (move a1 h1 loc3)
   deleted: (at a1 h1)
   added: (at a1 loc3)
   goals met: 2 of 3
10. (pickup-patient p3 a1 loc3)
   deleted: (patient-at p3 loc3) (empty a1)
   added: (in-ambulance p3 a1)
   goals met: 2 of 3
11. (move a1 loc3 h1)
   deleted: (at a1 loc3)
   added: (at a1 h1)
   goals met: 2 of 3
12. (dropoff-patient p3 a1 h1)
   deleted: (in-ambulance p3 a1)
   added: (patient-at p3 h1) (empty a1)
   goals met: 3 of 3
